; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-53)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 - object)
 (:init 
    (arm-empty)
    (clear b2)
    (on b2 b8)
    (on b8 b10)
    (on b10 b4)
    (on b4 b5)
    (on b5 b1)
    (on-table b1)
    (clear b3)
    (on b3 b13)
    (on b13 b14)
    (on b14 b11)
    (on b11 b6)
    (on b6 b15)
    (on b15 b12)
    (on b12 b16)
    (on b16 b7)
    (on b7 b9)
    (on-table b9))
 (:goal (and 
(on b1 b15)
))
)

; plan
1. (unstack b3 b13)
   deleted: (on b3 b13) (clear b3) (arm-empty)
   added: (holding b3) (clear b13)
   goals met: 0 of 1
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
3. (unstack b13 b14)
   deleted: (on b13 b14) (clear b13) (arm-empty)
   added: (holding b13) (clear b14)
   goals met: 0 of 1
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
5. (unstack b14 b11)
   deleted: (on b14 b11) (clear b14) (arm-empty)
   added: (holding b14) (clear b11)
   goals met: 0 of 1
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
7. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 0 of 1
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
9. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 0 of 1
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
11. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 0 of 1
12. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
13. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 0 of 1
14. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
15. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 0 of 1
16. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
17. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 0 of 1
18. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
19. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 0 of 1
20. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
21. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 0 of 1
22. (stack b1 b15)
   deleted: (clear b15) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b15)
   goals met: 1 of 1
